app/controllers/poetries_controller.rb

  def create
    Poetry.create(poetry_params)
---
INSERT INTO "poetries" ("title", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["author", ""], ["body", ""], ["created_at", "2018-12-28 17:47:00.936810"], ["updated_at", "2018-12-28 17:47:00.936810"]]

  def update
    @poetry.save
---
INSERT INTO "poetries" ("title", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["author", ""], ["body", "h"], ["created_at", "2019-01-24 21:34:52.221265"], ["updated_at", "2019-01-24 21:34:52.221265"]]

  def set_poetry
    @poetry = Poetry.find(params[:id])
---
SELECT  "poetries".* FROM "poetries" WHERE "poetries"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]